#Белякова 3 вариант
print("start code ...")
books=[
    {
        "название":"Мастер и Маргарита",
        "автор":"М.Булгаков",
        "год":"1869"
    } ,
    {
        "название":"Война и Мир",
        "автор":"Лев Толстой",
        "год":"1867"
    },
    {
        "название":"Преступление и наказание",
        "автор":"Ф.Достоевский",
        "год":"1866"
    },
    {
        "название":"Маленький принц",
        "автор":"Экзюпери",
        "год":"1942"
    },
    {
        "название":"Этим летом я стала красивой",
        "автор":"Дженни Хан",
        "год":"2009"
    }
]
print("Мои любимые книги:")

for book in books:
    print('-' * 30 + f"Название: {book["название"]}" + '-' * 30)
    print('-' * 40 + f"Автор: {book["автор"]}" + '-' * 40)
    print('-' * 50 + f"{book["год"]}" + '-' * 50)
print("... end code")